Repository: incolumepy-prospections/incolumepy.prospect.lumache
Catalog: docs/source/locale/*/LC_MESSAGES/usage.po
Languages: pt_br

source: Usage
pt_br: Utilização

source: Installation
pt_br: Instalação

source: To use Lumache, first install it using pip:
pt_br: Para usar Lumache, primeiro instale-o utilizando o pip:

source: or install it using poetry:
pt_br: ou utilizando o poetry

source: Creating recipes
pt_br: Criando receitas

source: To retrieve a list of random ingredients, you can use the ``lumache.get_random_ingredients()`` function:
pt_br: Para receber uma listagem de ingredientes aleatória, voce pode usar a função``lumache.get_random_ingredients()``:

source: Return a list of random ingredients as strings.
pt_br: Retorna uma lista de strings com ingredientes aleatórios.

source: Parameters
pt_br: Parametros

source: Optional "kind" of ingredients.
pt_br: Opcional "kind" de ingredientes.

source: Raises
pt_br: Exceções

source: If the kind is invalid.
pt_br: Se kind for inválido.

source: Returns
pt_br: Retorno

source: The ingredients list.
pt_br: A Lista de ingredientes

source: Return type
pt_br: Tipo de retorno

source: Raised if the kind is invalid.
pt_br: Exceção se kind for inválido.

source: **Exemple**
pt_br: **Exemplo**
